code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПредоставленныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПредоставленныеДокументы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Включая</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПредоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоставленнаяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыW8</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеТарифногоПлана</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовУдостоверяющихПолномочия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПредоставленныеДокументы/Forms/ФормаЗаписи/Ext/Form/Module.bsl
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - Булево - Признак отказа от создания формы
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДоступностьДляW8();
	
	Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
	Если Копирование Тогда
		
		Запись.Основание = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновленыПредоставленныеДокументы",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленнаяФормаПриИзменении(Элемент)
	ОбновитьДоступностьДляW8();
	ОбновитьРеквизитыПоПредоставленнойФорме();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьДляW8()
	ДоступностьW8 = НЕ ЗначениеЗаполнено(Запись.ПредоставленнаяФорма);
	Элементы.СрокДействия.Доступность = ДоступностьW8;
	Элементы.ДатаПредоставления.Доступность = ДоступностьW8;
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыПоПредоставленнойФорме()
	Запись.СрокДействия = Запись.ПредоставленнаяФорма.СрокДействия;
	Запись.ДатаПредоставления = Запись.ПредоставленнаяФорма.ДатаПредоставления;
КонецПроцедуры
